# lesson_2_13_задачи
"""Задача."""
# В водим через клавиатуру имена гостей
# Добавляем из в переменную список
# Выодим текст приглошение на мероприятетие каждуму гостю из списка
gosty = ["Леонид", "Слава", "Коля", "Серёжа"]

print(type(gosty))  # Вывод типа данных переменой
print(gosty)    # Вывод списка
