# lesson_2_4
"""Определение типа данных."""


var_1 = 1   # Целочислееное число

var_2 = 2.5  # Число с плавающёй запятой

var_3 = "Привет мир"    # Строка

var_4 = True    # Истина/лож

var_5 = [1, 2, 3, 4, 5]  # Список

var_6 = {"Alex", "Olga", "Semen", "Nasty", "alex"}  # Множества

var_7 = {"Папа": "Alex", "Мама": "Olga", "Сын": "Semen", "Доч": "Nesty"}    # Словарь (ключ:значение)

print(type(var_1))  # Система вернёт тип значения переменой var_1
print(type(var_2))  # Система вернёт тип значения переменой var_2
print(type(var_3))  # Система вернёт тип значения переменой var_3
print(type(var_4))  # Система вернёт тип значения переменой var_4
print(type(var_5))  # Система вернёт тип значения переменой var_5
print(type(var_6))  # Система вернёт тип значения переменой var_6
print(type(var_7))  # Система вернёт тип значения переменой var_7
