# lesson_2_12_operator
"""Списки."""


personal = ["Alex", "Ivan", "Nasty", "Olga"]     # Список
#              0      1        2        3
result = personal[0] + " + " + personal[2]    # Взять первый элемент списка и сложить со вторым элементом скипска.
print(result + " - Лучшая пара")  # Вызываем из списка результат сложения и фраза (константинация)
number = [1, 15, 23, 4] # Список из цифр
#         0   1   2   3
print(number[2])    # Выводим из списка второй элемент
result_num = number[0] + number[2] # Складывавем элементы из списка 0 и 2
print(result_num)    # Выводим результат сложения 

num_1 = number[0]   # Переменная хранит значениея из списков
num_2 = number[2]    # Переменная хранит значениея из списков
rez = num_1 + num_2    # Складываем переменные
print(rez)  # Выводим результат сложения
